{
	"factions": [{
			"name": "alliance",
			"quickInfo": "The modern Alliance is the successor to the Alliance of Lordaeron, which was created at the behest of King Terenas Menethil II of Lordaeron and Lord Anduin Lothar of the kingdom of Stormwind following the First War, five years after the reckoning. The human, dwarf, gnome, and high elf races allied together to fight off the orcish Horde.",
			"longInfo": "The Alliance is not a uniform governmental body, but is a coalition of mutual military and economic aid. Housing the Alliance Assembly, Theramore can be considered the official home of the new Alliance, but both the people and the leadership of Stormwind find it hard to accept. The inability of Stormwind to act forced both Theramore and the night elves to step in, resulting in a growing gap of cooperation between the two continents. Effectively, today's Alliance is in fact two Alliances not only working largely seperately but also holding some kind of dislike against each other. Above all, where Jaina Proudmoore and Tyrande Whisperwind are good at coordinating their efforts on Kalimdor, Lady Katrana Prestor of Stormwind is doing a fine job of undoing the Alliance in the Eastern Kingdoms. In the past, certain rules, customs, and regulations were a constant hindrance to mutual actions across the entire Alliance.This made cooperation sluggish, and considerably slowed the rate at which the Alliance was able to reclaim its former lands and glory.Despite the problems and intrigues within their leadership, all parts of the Alliance are steadfast in their desire to reclaim and rebuild, and all members share a distrust of the Horde.According to the RPG books(Lands of Mystery and Lands of Conflict), about 300, 000 souls belong to the allied races, across two continents.The Alliance is a great and peaceful body overall, their might being legendary, but their desire for peace, even stronger. Even now, as always, humans are the glue that hold the Alliance together, being the most numerous and diplomatic of the four races.However, the driving force of the Alliance is slowly but steadily shifting to the night elves, who today are a major aspect of the Alliance military forces - whereas the armies of Stormwind keep being held inactive within the city walls.",
			"races": [{
					"race": "human",
					"classes": ["Mage", "Paladin", "Priest", "Rogue", "Warlock", "Warrior"],
					"shortDesc": "Humans are among the youngest races on Azeroth, but they make up for it by being the most populous. With life spans generally shorter than the other races, humans strive all the harder to achieve great heights in empire building, exploration, and magical study. Their aggressive and inquisitive nature lead the human nations to become active and influential in the world.Such was the case prior to the orcs' original invasion through the Dark Portal. Human kingdoms suffered greatly in the three wars against forces of the demonic Burning Legion's creating, The Horde in the first two, and The Scourge in the third.Many humans fell in the Third War, leaving behind battered yet unbowed survivors of the Human Expedition under the command of the sorceress Jaina Proudmoore(following the prophet advice to Thrall as well). This group(Lordaeron survivors) settled on the wild continent of Kalimdor. Where they founded Theramore. To later The Horde, under Garrosh Hellscream rule, completely destroys the town.Lordaeron, a former human city, is decimated - a battlefield for forest trolls, the Scourge, Forsaken, ogres, and other creatures. The few humans who remain in Lordaeron struggle to keep their small settlements free of the villainy that boils around them. Stormwind City, the first to feel the orcs' rage, fares better and is the most powerful human nation remaining. Still, the city is far from safe, and enemies persistently attack it.Humans value virtue, honor, and courage, though like all races, they also pursue power and wealth. Humans have spent generations battling dark forces and have lost some of their greatest kingdoms to them. This loss embitters humans, and they have a view of diplomacy that does not favor negotiations. Aided by belief in the Holy Light, humans have fought hard and endured much during the wars against the Horde and the Burning Legion.Despite all their tragedies, humans show hardiness, bravery and nobility, and are thoroughly committed to building strong societies, re-inforcing their kingdoms, and reclaiming their nations. Years of war have tempered human resolve, giving them a determined nature."
				},
				{
					"race": "dwarf",
					"classes": ["Hunter", "Paladin", "Priest", "Rogue", "Warrior"],
					"shortDesc": "Dwarves are short and stout creatures mostly inhabiting Khaz Modan in the Eastern Kingdoms. They are shorter than humans but taller than gnomes, taking advantage of their size when possible and relying on their robustness and strength when not. The average dwarf is steady, observant and composed both during work and combat, yet able to rage with fierce zeal and persistence when the situation calls for it. While a dwarf prefers to plan forward to overcome challenges, many of them easily lose their temperament and self-restraint when exposed to conditions stirring their feelings and concerns.In past ages, the dwarves rarely left the safety of their mountain fortresses, spending their time on refining metal and stone into powerful weapons and beautiful jewelry. However, when the call to battle sounded, they rose up to defend their friends and allies with unmatched courage and valor. Dwarves like drinking, Mining, and finding treasure. But the things the dwarves are most interested about is them and their past with the Titans."

				},
				{
					"race": "night-elf",
					"classes": ["Druid", "Hunter", "Priest", "Rogue", "Warrior"],
					"shortDesc": "The night elves are the direct descendants of dark trolls. This tribe of fierce warriors took up residence at the Well of Eternity. The magic contained within altered their physical appearance, making them into the night elves known today.Theirs is a most ancient heritage, which has shaped them into a very self-sufficient and self-conscious people that often display strong streaks of isolationism. With the Well of Eternity once located at the very center of their civilization, the night elves were the first and the greatest wielders of magic, putting the craft to use with unmatched brilliance and inspiration. However, the arrogance of their highest caste, the Highborne, caused an increase in the reckless use of magic that the Well granted which, ultimately, allowed the Burning Legion to first find its way into Azeroth.[3] The Highborne fell under the thrall of Sargeras, and an apocalyptic confrontation between the remaining night elves and the invading Legion was set into motion that became known as the War of the Ancients. The outcome changed Azeroth for all time, causing a Sundering which tore the landmasses of the world apart and gave rise to the Maelstrom.Although the mighty night elves proved capable of putting a decisive halt to the Legion's onslaught, and thus ending the war and arguably saving the world, both their civilization and the world itself were shattered as a result, a difficult paradox and burden the remaining night elves live with. Left with nothing else but their lives the night elves withdrew to their ancestral forests of Ashenvale and isolated their culture from the rest of Azeroth for nearly ten millennia, renouncing magic and becoming devoted wholly to the natural cycle of the world they had almost led to ruin. Ever since, their ways have revolved around an intimate connection to the natural forces, animistic powers and the worship of their mysterious moon goddess, Elune. The night elves now stand as a people who are both highly spiritual and pragmatic, an often sophisticated paradox, and are possessed with a deeply seated desire to find their solace. It is thus no surprise that they have become great healers and will aid all sorts of creatures partly due to their nature and perhaps partly because it helps them find their solace in reconciling for mistakes of the past.Virtually all remaining night elves consider it their sworn duty to maintain the safety and balance of the natural world. They are generally honorable; a strict but just and truly compassionate people. Even so, they tend to be dismissive and distrustful of the younger races they now find within the world, and whom they consider to either be living in stubborn ignorance (for war-mongering and the destruction of nature), or as too short-lived to ever attain the responsibility and wisdom which the night elves have gained through their burdened past. In turn, many of these younger cultures perceive the night elves' attitude as one of mere arrogance or of superiority. The night elves tend to be looked upon with awe, wonder, and even mistrust, if not for their shadowy and secretive nature, longevity, and ancientness met with youthful appearance (they look forever young), then for their aloof and judging demeanor."
				},
				{
					"race": "gnome",
					"classes": ["Mage", "Rogue", "Warlock", "Warrior"],
					"shortDesc": "Gnomes are a diminutive, wiry race of tinkers who live underground. In the Second War, they built gadgets and vehicles, such as submarines and flying machines, for the Alliance to combat the Horde. They are great mechanics and inventors, renowned for their knowledge and eccentric natures. The gnomes had a city, Gnomeregan, built into Ironforge Mountain, but invading troggs destroyed it and slaughtered its citizens. Many survivors now live with the Ironforge dwarves, a few traveling with their dwarven friends to Kalimdor. The gnomes are still reeling from the destruction of their home city and are loath to leave the safety of the dwarven tunnels.Most gnomes on Kalimdor remain secluded in Bael Modan. Even after the decimation of their race and the destruction of their city, gnomes are an amiable and kindhearted lot. They make and keep friends easily; other races often find disliking a gnome to be difficult. Gnomes are long-lived and take a fatherly approach to other races, particularly humans. Gnome society is loosely organized, with most living in Khaz Modan and mixing freely with the dwarves, sending representatives to speak to the dwarven king on their behalf. Those few gnomes who traveled to Kalimdor live in a similar fashion in Bael Modan. Gnomes are gifted tinkers, and have a penchant for creating radical technology and innovative designs. They often work together with Ironforge dwarves, developing the blueprints and concepts from which the dwarf smiths draw their inspiration."
				}
			]
		},
		{
			"name": "horde",
			"quickInfo": "The Horde is one of the two major political factions of the mortal races in Azeroth, its counterpart being the Alliance.",
			"longInfo": "In the past, the Horde referred to the orcs and their battle thralls from both Draenor and Azeroth, such as trolls and ogres (see more about the old Horde). Following its utter defeat at the end of the Second War, the old Horde's power was forever broken, allowing Thrall to awaken the dormant spirituality of his people and free them from the Burning Legion's control. During the events of the Third War, Thrall has made lasting bonds with the tauren chief Cairne Bloodhoof and the troll shadowhunter Vol 'jin of the Darkspear clan. The ties between the three races is very close, as both share many similar cultural views. With the help of the tauren, both the orcs and the tribe of trolls have established a place for themselves in Kalimdor. Since then, certain ogre tribes, as well as the Forsaken (due to their lack of other options), have chosen to affiliate themselves with the Horde..",
			"races": [{
					"race": "orc",
					"classes": ["Hunter", "Rogue", "Shaman", "Warlock", "Warrior"],
					"shortDesc": "To their enemies, they are brutal and fearsome opponents, without parallel in their ferocity and cunning. To their allies, they are noble and honorable, following the traditions of a rediscovered past. The orcs of Lordaeron are part of a race that has once again found its true spirit, shunning the cruel practices of arcane and demonic magic for the paths of wisdom and power. Some orcs still hang on to the arcane practices of the past, but their time is fading. Though brutal in combat, orcs fight with a feral grace that equals even the finest fencing of an elven noble. For an orc, skill in battle brings great honor. The concept of personal honor that pervades all echelons of orcish society has made the race more cohesive and more of a threat to their adversaries in the Alliance. Even the naming of an orc is temporary until he has performed a rite of passage. Once an orc has brought honor to his name and the name of his clan, the elders give him a second name based upon his deed.For an orc, personal reputation is as important as his or her clan, and most will fight to the death in defense of either. This is in drastic contrast to when they were led by the forces tainted by the Burning Legion, and were a bestial force barely controlled by demonic magic. While the orcs might seem quick to anger, they are tempered by the wisdom of their leaders and their shamans. There are few of the demon-worshiping clans left, for the Alliance or the Horde itself has hunted down most of the remnants of such clans. Now, most of the orcs have embraced the values embodied in the leadership of Thrall as taught by his mentor, Orgrim Doomhammer. The orcs are one of the most populous races on the world of Azeroth. While many of the Alliance races perceive them to be brutish and savage, the orcs have forged a complex society that embraces many occupations and many different races. No doubt the leadership of Thrall and the support of the tauren and jungle troll elders has aided in this solidarity, but it is quite apparent that humanity has underestimated the ability of the orcs to unify and create their own distinct and powerful culture. Perhaps in time, the two factions might come to an understanding, but with the current division of Alliance and Horde, no one can say how or when peace might come.When they were freed from the Burning Legion, orcs experienced a cultural revolution as the unnatural, arcane bloodlust left their bodies, giving them calmer and more focused states of mind. They, for the most part, follow Thrall as he forges ahead to reform the Horde both inside, with his shamanism, and outside, with the founding of Durotar. Still, not all orcs are pleased with these movements, namely the evil orcs who still reside on Azeroth. These orcs, who include a good number of the surviving warlocks, actively raid Alliance and Independent caravans and towns, and renounce all that Thrall proclaims the Horde is. Like the two faces of the Alliance, the different Horde factions meet rarely; but there are some orc warlocks on Kalimdor who would very much like to retake control of the Horde forces and are gaining strength in the wilderness to do so."
				},
				{
					"race": "forsaken",
					"classes": ["Mage", "Priest", "Rogue", "Warlock", "Warrior"],
					"shortDesc": "Undead humans and elves freed from the Lich King's control, the Forsaken are a strange and dark force. Hailing from the twisted, skittering darkness of Undercity, the Forsaken are nominally allied with the Horde but serve only themselves. Their objectives are twofold: eliminate the Scourge, and establish a place for themselves on Azeroth. Four years ago, the high elven Ranger General Sylvanas Windrunner fell in combat against the Scourge. Prince Arthas raised her as a banshee and compelled her to follow his command. When the Lich King's power waned in the incidents surrounding the Frozen Throne, Sylvanas harnessed her fury and tore herself free from his skeletal grasp. She freed many other undead as well, and recruited powerful allies from the Burning Legion and the surrounding ogre clans. Sylvanas dubbed her new force the Forsaken, and the undead established their capital in the labyrinthine crypts beneath Lordaeron's capital city. Their sprawling, subterranean realm is called Undercity. The Forsaken made allies of the Horde out of necessity and convenience. They have no love for orcs, tauren or any other living creature, but they need time to strike against the Scourge and allies to help them do it. The Forsaken claim that they joined the Horde to prove their desire to leave their evil ways behind, but no one really believes this. The Horde accepts the Forsaken's help, as they do indeed have a common enemy: the Scourge.The Horde is leery of the Forsaken's tactics, however, and keeps watchful eyes on them. This caution is justified. Forsaken culture is strange, a perverse combination of the lives they once knew as mortals and the mindless slavery they experienced in the Scourge, colored by white-hot rage toward the Lich King and an almost equally intense devotion to their queen. Never sleeping, eating or falling ill, abandoned by those they once loved, the Forsaken have a brutal set of priorities. A great portion of their efforts focus on dark alchemy, and the Royal Apothecary Society commands great power in Undercity's oily tunnels. The apothecaries constantly send Forsaken on missions to gather odd materials for their twisted experiments. Rumors tell that the undead creatures are working to create a plague that will exterminate the Scourge and every living being on Azeroth. Are the Forsaken evil? At times it can be difficult to tell. Some Forsaken attempt to reclaim their humanity by acting in kind and helpful ways. Others allow hatred to fester into cruelty and rage. All that can be said is that the Forsaken follow their own agendas, and the rest of the world be damned; and if they have their way, it will be. Not all Forsaken are evil, but many are, and other races definitely view them as such. A non-evil Forsaken must work hard to prove his or her neutral (or perhaps, good) intentions. Few good Forsaken exist, but many evil ones do, and their leadership is definitely up to nefarious ends. Most Forsaken are pretty despicable, and their motivations as a race are evil and destructive.The Forsaken are humanoids transformed into the undead, with all the powers associated with the Scourge. They serve the Banshee Queen, Sylvanas, looking to her as their savior for delivering them from the Lich King's mental dominance. The Forsaken dwell within the bowels of the ruins of Lordaeron's capital city, which they have taken to calling the Undercity. Dedicated to seek vengeance upon the Scourge for damning them to their condition, they strive to undermine the Scourge's control of Lordaeron. The Forsaken have been limited in their ability to reinforce their numbers, having no necromancers among their kind. Instead, these fearless undead warriors are comprised mostly of fighters and warlocks dedicated to building a culture of their own amidst a world that hates and fears them.Only recently has Sylvanas recruited and trained necromancers into the Forsaken ranks."
				},
				{
					"race": "tauren",
					"classes": ["Druid", "Hunter", "Shaman", "Warrior"],
					"shortDesc": "The plains of Kalimdor have long been a home to these gargantuan nomads. The tauren are a race of shamans, hunters, and warriors who long ago developed a complex culture and system of living without the aid of stonework, steel or conquest. This is not to say that the tauren are a race of pacifists, for when they are angered they are capable of retaliating with swift and decisive brutality. Tauren are, in a word, stoic, embodying the strong and silent type with their quiet contemplation. This introspective air combined with their immense size are why many view the tauren as a wise and dangerous race. Tauren rarely speak unless there is a true reason to, preferring to act instead of talk. However, once a tauren has learned to interact with a companion, there seems to be a more open and enthusiastic exchange of words. Since tauren warm slowly to non-tauren, they are usually silent and may sometimes appear brooding. This silence may be attributable to the strife of recent times. Tauren have no love for bloodshed, as their deep spiritual beliefs do not have a place for warfare. The elders of a tribe solve most issues, or two tauren might resolve a conflict with a ritual challenge resembling a duel. Having become members of the Horde, the introspective race has been involved in more and more conflict, creating a demand for tauren warriors and healers. Many must spend time putting great thought into the actions they perform on the field of battle. Taking another life, whether it is man or beast, is an act filled with great significance and responsibility to the tauren."
				},
				{
					"race": "troll",
					"classes": ["Hunter", "Mage", "Priest", "Rogue", "Shaman", "Warrior"],
					"shortDesc": "Trolls (aka trollkind) are a diverse sapient race in Azeroth and can be found in every part of the world. They average seven feet in height and two hundred pounds in weight. Two exceptions to this are the Drakkari and the Zandalari, who tend to be somewhat larger than their kindred. As with other races, there are also scattered trolls who far exceed the normal size range. For further discussion of these outliers, consult the below section on these so-called monstrous trolls. There are several races of troll. Many trolls have no loyalty except amongst their own tribes, with the exception of the Darkspear tribe, Shatterspear tribe, and Revantusk tribe, the former two being part of the Horde, while the latter being allies of them.Darkspear are the playable trolls in World of Warcraft.Although the Darkspear are the weakest and smallest of all the troll races, they are the most cunning and intelligent and can still grow to rather immense sizes.For example, Darkspear Berserkers in Warcraft III were larger even than grunts."
				}
			]
		}
	]
}